{
  "id": "deploy-army",
  "oncePerRound": false,
  "fortune": false,
  "enabled": true,
  "phase": "army",
  "dc": "control",
  "title": "Deploy Army",
  "automationNotes": "HP and Conditions need to be managed by hand.",
  "description": "The army moves through your kingdom or beyond. Since this travel occurs over the course of the entire month that preceded the Kingdom turn, the ground an army covers when it deploys can be quite extensive. You can Deploy an Army with an Exploration, Boating, or Magic check. When you use an Exploration check, choose a location within 20 hexes of the army’s current hex. If the army’s starting point and ending point are connected by a road, increase the result one degree of success. Count roadless hexes that contain swamps or mountains, or each hex where you must cross a river or lake without the aid of a bridge, as two hexes. You can issue orders to force march. Doing so grants a +4 circumstance bonus on the check, but causes the army to increase its weary condition by 1 (or by 2, if you fail the check). When you use a Boating check, the army’s starting point and ending point must be connected by a body of water; choose any location within 20 hexes along this route. You must be at least master in Magic to attempt a Magic check. When you do so, choose any location within 30 hexes of the army’s current hex, then roll your check. If the army’s deployment causes it to cross your kingdom’s border, the DC increases by 5. If the army’s deployment causes it to cross an enemy kingdom’s border, the DC instead increases by 10.",
  "modifiers": [
    {
      "enabled": false,
      "value": 0,
      "upgradeResults": [
        {
          "upgrade": "criticalFailure"
        },
        {
          "upgrade": "failure"
        },
        {
          "upgrade": "success"
        }
      ],
      "buttonLabel": "Starting and End Point connected by a Road",
      "name": "Starting and End Point connected by a Road",
      "type": "untyped",
      "applyIf": [
        {
          "eq": [
            "@skill",
            "exploration"
          ]
        }
      ]
    },
    {
      "enabled": false,
      "value": 4,
      "buttonLabel": "+4 circumstance to Force a March",
      "name": "Force a March",
      "type": "circumstance",
      "applyIf": [
        {
          "eq": [
            "@skill",
            "exploration"
          ]
        }
      ]
    },
    {
      "enabled": false,
      "value": -5,
      "buttonLabel": "+5 DC Increase if Deploying across your border",
      "name": "Deploying across your border",
      "type": "untyped",
      "applyIf": [
        {
          "eq": [
            "@skill",
            "magic"
          ]
        }
      ]
    },
    {
      "enabled": false,
      "value": -10,
      "buttonLabel": "+10 DC Increase if Deploying into enemy territory",
      "name": "Deploying into enemy territory",
      "type": "untyped",
      "applyIf": [
        {
          "eq": [
            "@skill",
            "magic"
          ]
        }
      ]
    }
  ],
  "skills": {
    "exploration": 0,
    "boating": 0,
    "magic": 3
  },
  "criticalSuccess": {
    "msg": "The army arrives much more quickly than you anticipated; it arrives at its destination and then becomes efficient."
  },
  "success": {
    "msg": "The army arrives at its destination. "
  },
  "failure": {
    "msg": "The army arrives at its destination, but ran into some sort of trouble along the way. Increase the army’s weary condition by 1 and attempt a @Check[type:flat|dc:6]; on a failure, reduce the army’s HP by 1."
  },
  "criticalFailure": {
    "msg": "Rather than arriving at its destination, the army becomes lost until it recovers from this condition. <button type=\"button\" class=\"km-gain-lose\" data-type=\"unrest\" data-mode=\"gain\" data-turn=\"now\" data-multiple=\"false\" data-value=\"1d4\">Gain 1d4 Unrest</button>, and attempt a @Check[type:flat|dc:11]; on a failure, reduce the army’s HP by 1."
  }
}