{
  "id": "recruit-monsters",
  "oncePerRound": false,
  "fortune": true,
  "enabled": false,
  "phase": "region",
  "dc": "control",
  "title": "Recruit Monsters",
  "description": "While you are quick to suggest that most of the monsters the party encounters during their adventures deserve killing, you also understands that there can be exceptions. Some can be bribed or allied with, while others can be trusted to act on their instincts—a canny person can capitalize on these instincts or alliances to bolster a kingdom’s defenses. Attempt a basic Intrigue check.",
  "skills": {
    "intrigue": 0
  },
  "criticalSuccess": {
    "msg": "You manage to locate a monster’s lair and take steps to incorporate it into your kingdom’s defense. The next time your kingdom suffers a Bandit Activity, Monster Activity, Sacrifices, or Undead Uprising random event, you can use your recruited monster to help resolve the event. Doing so removes the Recruited Monster from your kingdom (you can attempt to recruit a new monster on a future kingdom turn though) but allows you to roll a skill check twice when resolving the Dangerous Hex event, taking the better of the two results as your actual result. This is a fortune effect.Your kingdom can support 1 Recruited Monster at a time. If your kingdom is master in Intrigue, you can support up to 2 Recruited Monsters at a time, and if your kingdom is legendary in Intrigue, you can support up to 3 Recruited Monsters at a time.",
    "modifiers": [
      {
        "type": "untyped",
        "name": "Use Recruited Monster",
        "buttonLabel": "Gain A Monster",
        "isConsumedAfterRoll": true,
        "enabled": false,
        "rollTwiceKeepHighest": true,
        "fortune": true,
        "applyIf": [
          {
            "eq": [
              "@phase",
              "event"
            ]
          }
        ],
        "value": 0
      }
    ]
  },
  "success": {
    "msg": "You locate a monster’s lair but can’t recruit it into your kingdom’s defense just yet. If you attempt this activity on your next kingdom turn; the result of that check is improved one degree as you continue to build a rapport with the monster.",
    "modifiers": [
      {
        "type": "untyped",
        "name": "Recruit Recruited Next Turn",
        "buttonLabel": "Upgrade Degree to Recruit Monster Next Turn",
        "isConsumedAfterRoll": true,
        "enabled": false,
        "upgradeResults": [
          {
            "upgrade": "criticalFailure"
          },
          {
            "upgrade": "failure"
          },
          {
            "upgrade": "success"
          }
        ],
        "turns": 2,
        "applyIf": [
          {
            "eq": [
              "@activity",
              "recruit-monsters"
            ]
          }
        ],
        "value": 0
      }
    ]
  },
  "failure": {
    "msg": "You fail to locate a monster, or if you were recruiting a monster you didn’t succeed at recruiting on the previous turn, that monster moves on and you must start the recruitment procedure from scratch in the future."
  },
  "criticalFailure": {
    "msg": "You found a monster, but it proves impossible to recruit. Worse, you’ve attracted its attention. A Monster Activity event occurs during the kingdom’s next Event Phase, in addition to any other potential random events."
  }
}