{
  "id": "the-local-paper",
  "name": "The Local Paper",
  "traits": ["beneficial"],
  "description": "<p>This event takes place on the one Kingdom Turn after the turn during which the PCs build their first printing house. Access to the printing press allows for the production of an initially modest weekly flyer that gathers news and presents stories of interest. Over time, this flyer grows in size, potentially becoming something akin to a local newspaper, but only if your printing house can keep up with the demand.</p><p>While it doesn’t directly impact the effects of this event, you should encourage your players to come up with a fun name for their kingdom’s paper.</p>",
  "stages": [
    {
      "leader": "counselor",
      "skills": ["industry"],
      "criticalSuccess": {
        "msg": "You gain access to the Read All About It leadership activity. More importantly, your industrious editors prove to be more than up to the task of keeping the presses running, and the people of the kingdom take to the new paper with delight. @lose1d4Unrest, and <button type=\"button\" class=\"km-gain-lose\" data-type=\"fame\" data-mode=\"gain\" data-turn=\"next\" data-multiple=\"false\" data-value=\"1\">Gain 1 Fame Next Turn</button>"
      },
      "success": {
        "msg": "You gain access to the Read All About It leadership activity, and while your people enjoy the paper, it’s always a grind to hit your deadlines. @lose1Unrest"
      },
      "failure": {
        "msg": "You gain access to the Read All About It leadership activity, but the stress of hitting deadlines puts a strain on your editors. @gain1Unrest"
      },
      "criticalFailure": {
        "msg": "You fail to get the local paper off the ground, and your frustrated editors spread word of how you mismanaged the affair. @gain1d4Unrest and <button type=\"button\" class=\"km-gain-lose\" data-type=\"strife\" data-mode=\"gain\" data-turn=\"now\" data-multiple=\"false\" data-value=\"1\">Gain 1 Strife</button>"
      }
    }
  ]
}